YUJJHH/Microcomputer_STM32F4IG_3.1-3.2/ADC3_채널테스트.c
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// HW3: USART 통신을 이용한 센서 모니터링
// 제출자: 2019130027 유정환
// 제출일:2023-11-20
//동작개요: 세가지 아날로그 신호(전압값) SQR에 순서대로 등록(CH1우선)하고, 
//              타이머 주기마다 AD변환, SCAN mode로 단일 ADC하여 
//              DMA를 통하여 메모리(ADC_value[3])에 저장하고 전압값변환하여 LCD에 표시 및 USART를 이용해 PC에 업로딩
// 주요 내용 및 구현 방법
// 온도센서 종류:  ADC1_CH1 (PA1) : 키트가변저항,   ADC1_CH8 (PB0) : 배포된 가변저항,  ADC1_CH16 : MCU 내부 온도센서 
// Memory: ADC_value[3]; [0] 키트가변저항, [1] 배포된 가변저항 , [2] MCP 내부온도센서
// ADC설정: ADC1, SCAN mode, CONT mode, 3 ch 변환, DMA mode, 12 bit RES, 
// DMA 설정: DMA2 Stream0 channel0(ADC1), Peripheral-to-memory (P=>M), DMA_BufferSize = 3 (ADC_Value[3])
//               Circular mode, Priority level - High, FIFO_direct mode, 
//               Peripheral address pointer is fixed, Memory address pointer is incremented after each data transferd 
// USART1: TX pin: PA9, RX pin: PA10 
// TX: Polling 방식, RX: Interrupt 방식
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include "FRAM.h"
#include "stm32f4xx.h"
#include "GLCD.h"

#define SW0_PUSH        0xFE00  //PH8
#define SW1_PUSH        0xFD00  //PH9
#define SW2_PUSH        0xFB00  //PH10
#define SW3_PUSH        0xF700  //PH11
#define SW4_PUSH        0xEF00  //PH12
#define SW5_PUSH        0xDF00  //PH13
#define SW6_PUSH        0xBF00  //PH14
#define SW7_PUSH        0x7F00  //PH15

void _GPIO_Init(void);
uint16_t KEY_Scan(void);
void USART1_Init(void);
void USART_BRR_Configuration(uint32_t USART_BaudRate);

void _EXTI_Init(void);

void SerialSendChar(uint8_t c);
void SerialSendString(char *s);

void RunMenu(void);
void _ADC_Init(void);
void DMAInit(void);

void DelayMS(unsigned short wMS);
void DelayUS(unsigned short wUS);

uint16_t ADC_value[2];

char str1[3];          //거리센서1 측정 문자열
char str2[3];          //거리센서2 측정 문자열


void TIMER1_OC_Init(void);            // Timer 1 (Output Compare mode)

uint16_t Vsense, Voltage,T;

void _ADC3_IN9_Init(void);

void _ADC3_IN1_Init(void);

  int x=0, y=1;      //막대그래프를 나타내기 위한 변수

 void TIMER14_PWM_Init(void);  // 추종차 방향 제어, 주기 400us
void TIMER4_PWM_Init(void);  // 추종차 속도 제어, 주기 5s
  
int MOVE_FLAG=0; //MOVE 상태 플래그



int main(void)
{
 _EXTI_Init();

        USART1_Init();
	_ADC_Init();          //이거 위치 바꿔야되나본데....
        
        
	DMAInit();
        _GPIO_Init();
        
	LCD_Init();		// LCD 구동 함수
	DelayMS(500);		// LCD구동 딜레이
          
	
	RunMenu();
        TIMER1_OC_Init();      // Timer 1 (Output Compare mode)
	
       TIMER14_PWM_Init();  // 추종차 방향 제어, 주기 400us
       TIMER4_PWM_Init();
       
           TIM4->CCR2=0;  //초기상태: 엔진 PWM  DR=0%
        
           
            Fram_Init();                    // FRAM 초기화 H/W 초기화
	Fram_Status_Config();   // FRAM 초기화 S/W 초기화
 
           
       //FRAM 저장값 리드
        
        MOVE_FLAG=Fram_Read(1201);  
      
        LCD_SetBackColor(RGB_WHITE);	//글자배경색 
        LCD_SetFont(&Gulim7);
        LCD_SetTextColor(RGB_BLUE);     //글자색 
        
        if(MOVE_FLAG==0)  //STOP 상태
        {
            MOVE_FLAG=0;        //MOVE 동작 x      
                
                LCD_DisplayText(1,24," S");  //STOP 표시
                   LCD_DisplayText(2,24," 0"); //D1 거리 0
                         LCD_DisplayText(3,24," 1"); // D2 거리 1
                       
                      
                  TIM4->CCR2=0;  //엔진 PWM  DR=0%
                      TIM14->CCR1=0;  //핸들 PWM  DR=0%
                      
          
            //D1 막대 지움
            LCD_SetBrushColor(RGB_WHITE);     //브러시색 흰색
            LCD_DrawFillRect(21,23,6*(19),9);    
            
     
             y=1;  // D2막대 1 표시
        
             
                 LCD_SetBrushColor(RGB_WHITE);     //브러시색 흰색
                 LCD_DrawFillRect(21+38*y,34,38*(3-y),9);    
             
                 LCD_SetBrushColor(RGB_GREEN);        //브러시색  초록   
                 LCD_DrawFillRect(21,34,38*y,9);   
             
         
                      
                      LCD_DisplayText(4,7,"00");  //엔진 PWM DR=0%
                       LCD_DisplayText(4,21,"F");  // 핸들 직진 F
                   
        
        }
        
       else if(MOVE_FLAG==1)  // MOVE 상태
       {
             MOVE_FLAG=1;   //MOVE 동작
             LCD_DisplayText(1,24," M");  //MOVE 표시
       }
  
       
       
       
       
       
       
 	while(1)
	{
	       
              if(MOVE_FLAG==1)   //MOVE 상태이면
             {       
                     
                     LCD_SetTextColor(RGB_BLACK);     //글자색 
                     LCD_DisplayText(4,0,"SP(DR):");
                     LCD_DisplayText(4,9,"%   DIR(DR):");
                     LCD_SetTextColor(RGB_BLUE);     //글자색 
             
                      if(y==0)                   //명령값 = 0 이면   (핸들 오른쪽 )
                      {
                          TIM14->CCR1 = 8*3;		// DR=30%
                          LCD_DisplayText(4,21,"R");
                      }
                      else if(y==1)             //명령값 = 1 이면      (핸들 직진 )
                      {
                          TIM14->CCR1 = 0;		// DR=0%
                           LCD_DisplayText(4,21,"F");
                      }
                      else if(y==2 || y==3)             //명령값 = 2~3 이면     (핸들 왼쪽 )
                      {
                          TIM14->CCR1 = 8*9;		// DR=90%
                           LCD_DisplayText(4,21,"L");
                      }
                      
                      
                      
                      if(x==3 || x==4)                   //측정거리 3~4m이면   
                      {
                          TIM4->CCR2 = 5000*1;		// DR=10%
                          LCD_DisplayText(4,7,"10");
                      }
                      else if(x==5 || x==6)               //측정거리 5~6m이면   
                      {
                           TIM4->CCR2 = 5000*2;		// DR=20%
                           LCD_DisplayText(4,7,"20");
                      }
                      else if(x==7 || x==8)             //측정거리 7~8m이면   
                      {
                           TIM4->CCR2 = 5000*3;		// DR=30%
                           LCD_DisplayText(4,7,"30");
                      }
                      else if(x==9 || x==10)              //측정거리 9~10m이면   
                      {
                           TIM4->CCR2 = 5000*4;		// DR=40%
                           LCD_DisplayText(4,7,"40");
                      }
                     else if(x==11 || x==12)              //측정거리 11~12m이면   
                      {
                           TIM4->CCR2 = 5000*5;		// DR=50%
                           LCD_DisplayText(4,7,"50");
                      }
                      else if(x==13 || x==14)              //측정거리 13~14m이면   
                      {
                           TIM4->CCR2 = 5000*6;		// DR=60%
                           LCD_DisplayText(4,7,"60");
                      }
                      else if(x==15 || x==16)             //측정거리 15~16m이면   
                      {
                           TIM4->CCR2 = 5000*7;		// DR=70%
                           LCD_DisplayText(4,7,"70");
                      }
                      else if(x==17 || x==18)             //측정거리 17~18m이면   
                      {
                          TIM4->CCR2 = 5000*8;		// DR=80%
                          LCD_DisplayText(4,7,"80");
                      }
                      else if(x==19)                       //측정거리 19m이면   
                      {
                           TIM4->CCR2 = 5000*9;		// DR=90%
                           LCD_DisplayText(4,7,"90");
                      }
            }
            
