YUJJHH/Microcomputer_STM32F4IG_3.1-3.2/ADC3_채널테스트.c
        }
}










void ADC_IRQHandler(void)
{
          ADC3->SR &= ~(1<<1);		// EOC flag clear 
  

    //     _ADC3_IN1_Init();
              //온도센서1, 키트 가변저항
        
        LCD_SetTextColor(RGB_BLUE);     //글자색 
        
       if(MOVE_FLAG==1)   
       {     sprintf(str1,"%2.0f",((3.3*ADC_value[0])*5)/4095+3);  //거리 표시 0~19
	     
               LCD_DisplayText(2,24,str1);
            
          
             x=atoi(str1); // 문자열  str1을 정수형으로 변환하여 x에 저장
        
           if(x>=1 && x<=19)     
             {
                 LCD_SetBrushColor(RGB_WHITE);     //브러시색 흰색
            
                    LCD_DrawFillRect(21+6*x,23,6*(19-x),9);    
             
                 LCD_SetBrushColor(RGB_RED);        //브러시색 빨강   
                 LCD_DrawFillRect(21,23,6*x,9);     
             
}
       
           
     
     //  _ADC3_IN9_Init();      일단 12비트로 함.....................
             //온도센서2, 배포된 가변저항
       
	     sprintf(str2,"%2.0f",(3.3*ADC_value[1])/4095);  //거리표시 0~3
       	     LCD_DisplayText(3,24,str2);
            
         
             y=atoi(str2); // 문자열  str2을 정수형으로 변환하여 y에 저장
        
             if((y>=0) && (y<=3))      
             {
                 LCD_SetBrushColor(RGB_WHITE);     //브러시색 흰색
                 LCD_DrawFillRect(21+38*y,34,38*(3-y),9);    
             
                 LCD_SetBrushColor(RGB_GREEN);        //브러시색  초록   
                 LCD_DrawFillRect(21,34,38*y,9);   
             }
          
             
             
       }
             ADC3->CR1 &= ~(3<<24);	// RES[1:0]=0b00 : 12bit Resolution
          
}


void _ADC_Init(void)
{
	/* 1st Analog signal */
	RCC->AHB1ENR |= 0x01;  	// RCC_AHB1ENR GPIOA Enable
	GPIOA->MODER |= (3<<2);	// GPIOA PIN1(PA1)        키트의 가변저항(온도센서1) : Analog mode
  
	/* 2nd Analog signal */
         RCC->AHB1ENR |= (1<<5);  	// RCC_AHB1ENR GPIOF Enable
	GPIOF->MODER |= (3<<6);	// GPIOF PIN3(PF3)         온도센서2: Analog mode

	/* ADC Common Init **********************************************************/
	RCC->APB2ENR |= (1<<10);	// RCC_APB2ENR ADC3 Enable
  
	ADC->CCR &= ~0X0000001F;// ADC_Mode_Independent
	ADC->CCR |= 0x00010000;	// ADC_Prescaler_Div4 (ADC MAX Clock 36Mhz, 84Mhz(APB2)/4 = 21Mhz
        
      

	/* ADC3 Init ****************************************************************/
	ADC3->CR1 &= ~(3<<24);	// RES[1:0]=0b00 : 12bit Resolution
	ADC3->CR1 |= 0x00000100;	// ADC_ScanCovMode Enable (SCAN=1)
	ADC3->CR1 |=  (1<<5);		// EOCIE=1: Interrupt enable for EOC
        
        ADC3->CR2 &= ~0x00000002;	// ADC_ContinuousConvMode Disable (CONT=0)            
	ADC3->CR2 |= (3<<28);	// EXTEN[1:0]=0b01: ADC_ExternalTrigConvEdge_Enable (Both Edge)
        
        ADC3->CR2 |= (2<<24);	// EXTSEL:TIM1_CC3
      
        ADC3->CR2 &= ~(1<<10);	//  EOCS =0:Endof conversion selection
	ADC3->CR2 &= ~(1<<11);	// ALIGN=0: ADC_DataAlign_Right
        
	ADC3->SQR1 |= (1<<20); // ADC Regular channel sequece length = 2 conversion

	/* ADC_RegularChannelConfig *********************************************/
   
	ADC3->SMPR2 |= 0x07 << (3*1);	//ADC3_CH1 Sample Time_480Cycles (3*Channel_1)  
	ADC3->SQR3 |= (1<< (5*(1-1)));  //ADC3_CH1 << (5*(Rank-1)), Rank = 1 (1순위로 변환: 키트 가변저항(거리센서1))

      
        ADC3->SMPR2 |= 0x07 << (3*9);	// ADC3_CH9 Sample TIme_480Cycles (3*Channel_1)  
	ADC3->SQR3 |= 9 << (5*(2-1));	// ADC3_CH9 << (5 * (Rank - 1)),  Rank = 2 (2순위로 변환: 가변저항(거리센서2))
 
             
	

/* Enable DMA request after last transfer (Single-ADC mode) */
        ADC3->CR2 |= (1<<9); // DMA requests are issued	as long as data are converted and DMA=1	
				// for single ADC mode
        
	/* Enable ADC1 DMA */
	ADC3->CR2 |= (1<<8);	// DMA mode enabled  (DMA=1)
	ADC3->CR2 |= 0x00000001;	// Enable ADC3:  ADON=1
  
        NVIC->ISER[0] |= (1<<18);	// Enable ADC global Interrupt
        
	/* Start ADC Software Conversion */ 
	ADC3->CR2 |= 0x40000000;   // SWSTART=1
}


void _ADC3_IN1_Init(void)
{
	/* 1st Analog signal */
//	RCC->AHB1ENR |= 0x01;  	// RCC_AHB1ENR GPIOA Enable
//	GPIOA->MODER |= (3<<2);	// GPIOA PIN1(PA1)        키트의 가변저항(온도센서1) : Analog mode
  
	

	/* ADC Common Init **********************************************************/
//	RCC->APB2ENR |= (1<<10);	// RCC_APB2ENR ADC3 Enable
  
//	ADC->CCR &= ~0X0000001F;// ADC_Mode_Independent
//	ADC->CCR |= 0x00010000;	// ADC_Prescaler_Div4 (ADC MAX Clock 36Mhz, 84Mhz(APB2)/4 = 21Mhz
        
      //  ADC->CCR |= (1<<23);	//Temperature sensor enable내부 온도 필요 x


	/* ADC3 Init ****************************************************************/
	ADC3->CR1 &= ~(3<<24);	// RES[1:0]=0b00 : 12bit Resolution
//	ADC3->CR1 |= 0x00000100;	// ADC_ScanCovMode Enable (SCAN=1)
//	ADC3->CR1 |=  (1<<5);		// EOCIE=1: Interrupt enable for EOC
        
 //       ADC3->CR2 &= ~0x00000002;	// ADC_ContinuousConvMode Disable (CONT=0)            
//	ADC3->CR2 |= (3<<28);	// EXTEN[1:0]=0b01: ADC_ExternalTrigConvEdge_Enable (Both Edge)
        
 //       ADC3->CR2 |= (2<<24);	// EXTSEL:TIM1_CC3
 //     
  //      ADC3->CR2 &= ~(1<<10);	//  EOCS =0:Endof conversion selection
//	ADC3->CR2 &= ~(1<<11);	// ALIGN=0: ADC_DataAlign_Right
        
//	ADC3->SQR1 |= (1<<20); // ADC Regular channel sequece length = 2 conversion

	/* ADC_RegularChannelConfig *********************************************/
   
	ADC3->SMPR2 |= 0x07 << (3*1);	//ADC3_CH1 Sample Time_480Cycles (3*Channel_1)  
	ADC3->SQR3 |= (1<< (5*(1-1)));  //ADC3_CH1 << (5*(Rank-1)), Rank = 1 (1순위로 변환: 키트 가변저항(거리센서1))

      
     

/* Enable DMA request after last transfer (Single-ADC mode) */
 //       ADC3->CR2 |= (1<<9); // DMA requests are issued	as long as data are converted and DMA=1	
				// for single ADC mode
        
	/* Enable ADC1 DMA */
//	ADC3->CR2 |= (1<<8);	// DMA mode enabled  (DMA=1)
//	ADC3->CR2 |= 0x00000001;	// Enable ADC3:  ADON=1
  
 //       NVIC->ISER[0] |= (1<<18);	// Enable ADC global Interrupt
        
	/* Start ADC Software Conversion */ 
//	ADC3->CR2 |= 0x40000000;   // SWSTART=1
}

