YUJJHH/Microcomputer_STM32F4IG_3.1-3.2/ADC3_채널테스트.c
void _ADC3_IN9_Init(void)
{

/* 2nd Analog signal */
 //        RCC->AHB1ENR |= (1<<5);  	// RCC_AHB1ENR GPIOF Enable
//	GPIOF->MODER |= (3<<6);	// GPIOF PIN3(PF3)         온도센서2: Analog mode

/* ADC Common Init **********************************************************/
//	RCC->APB2ENR |= (1<<10);	// RCC_APB2ENR ADC3 Enable
  
//	ADC->CCR &= ~0X0000001F;// ADC_Mode_Independent
//	ADC->CCR |= 0x00010000;	// ADC_Prescaler_Div4 (ADC MAX Clock 36Mhz, 84Mhz(APB2)/4 = 21Mhz

        
        /* ADC3 Init ****************************************************************/
	
//	ADC3->CR1 |= 0x00000100;	// ADC_ScanCovMode Enable (SCAN=1)
//	ADC3->CR1 |=  (1<<5);		// EOCIE=1: Interrupt enable for EOC
        
//        ADC3->CR2 &= ~0x00000002;	// ADC_ContinuousConvMode Disable (CONT=0)            
//	ADC3->CR2 |= (3<<28);	// EXTEN[1:0]=0b01: ADC_ExternalTrigConvEdge_Enable (Both Edge)
        
//        ADC3->CR2 |= (2<<24);	// EXTSEL:TIM1_CC3
//      
  //      ADC3->CR2 &= ~(1<<10);	//  EOCS =0:Endof conversion selection
//	ADC3->CR2 &= ~(1<<11);	// ALIGN=0: ADC_DataAlign_Right
        
//	ADC3->SQR1 |= (1<<20); // ADC Regular channel sequece length = 2 conversion
        
        
 //ADC3->CR1 |= (2<<24);	// RES[1:0]=0b00 : 12bit Resolution
  ADC3->SMPR2 |= 0x07 << (3*9);	// ADC3_CH9 Sample TIme_480Cycles (3*Channel_1)  
	ADC3->SQR3 |= 9 << (5*(2-1));	// ADC3_CH9 << (5 * (Rank - 1)),  Rank = 2 (2순위로 변환: 가변저항(거리센서2))
 
            
/* Enable DMA request after last transfer (Single-ADC mode) */
 //       ADC3->CR2 |= (1<<9); // DMA requests are issued	as long as data are converted and DMA=1	
				// for single ADC mode
        
	/* Enable ADC1 DMA */
//	ADC3->CR2 |= (1<<8);	// DMA mode enabled  (DMA=1)
//	ADC3->CR2 |= 0x00000001;	// Enable ADC3:  ADON=1
  
 //       NVIC->ISER[0] |= (1<<18);	// Enable ADC global Interrupt
        
	/* Start ADC Software Conversion */ 
//	ADC3->CR2 |= 0x40000000;   // SWSTART=1

}

/*
void _ADC_Init(void)
{
//	 1st Analog signal 
	RCC->AHB1ENR |= 0x01;  	// RCC_AHB1ENR GPIOA Enable
	GPIOA->MODER |= (3<<2);	// GPIOA PIN1(PA1) 키트의 가변저항(온도센서1) : Analog mode
  
//	 2nd Analog signal 
         RCC->AHB1ENR |= 0x02;  	// RCC_AHB1ENR GPIOB Enable
	GPIOB->MODER |= (3<<0);	// GPIOB PIN0(PB0) 온도센서2: Analog mode

//	 ADC Common Init **********************************************************
	RCC->APB2ENR |= (1<<8);	// RCC_APB2ENR ADC1 Enable
  
	ADC->CCR &= ~0X0000001F;// ADC_Mode_Independent
	ADC->CCR |= 0x00010000;	// ADC_Prescaler_Div4 (ADC MAX Clock 36Mhz, 84Mhz(APB2)/4 = 21Mhz
        
        ADC->CCR |= (1<<23);	//Temperature sensor enable


//	 ADC1 Init ****************************************************************
	ADC1->CR1 &= ~(3<<24);	// RES[1:0]=0b00 : 12bit Resolution
	ADC1->CR1 |= 0x00000100;	// ADC_ScanCovMode Enable (SCAN=1)
	ADC1->CR1 |=  (1<<5);		// EOCIE=1: Interrupt enable for EOC
        
        ADC1->CR2 &= ~0x00000002;	// ADC_ContinuousConvMode Disable (CONT=0)            
	ADC1->CR2 |= (3<<28);	// EXTEN[1:0]=0b01: ADC_ExternalTrigConvEdge_Enable (Both Edge)
        
        ADC1->CR2 |= (1<<24);	// EXTSEL:TIM1_CC2
         // ADC1->CR2 |= (15<<24);	// EXTSEL: EXTI11          이거로 하니까  sw3 누를때마다 실행
        
	ADC1->CR2 &= ~(1<<11);	// ALIGN=0: ADC_DataAlign_Right
        
	ADC1->SQR1 |= (2<<20); // ADC Regular channel sequece length = 3 conversion

//	 ADC_RegularChannelConfig *********************************************
   
	ADC1->SMPR2 |= 0x07 << (3*1);	//ADC1_CH1 Sample Time_480Cycles (3*Channel_1)  
	ADC1->SQR3 |= (1<< (5*(1-1)));  //ADC1_CH1 << (5*(Rank-1)), Rank = 1 (1순위로 변환: 키트 가변저항(온도센서1))

        ADC1->SMPR2 |= 0x07 << (3*8);	// ADC1_CH8 Sample TIme_480Cycles (3*Channel_1)  
	ADC1->SQR3 |= 8 << (5*(2-1));	// ADC1_CH8 << (5 * (Rank - 1)),  Rank = 2 (2순위로 변환: 가변저항(온도센서2))
 
        ADC1->SMPR1 |= 0x07 << (18);	// ADC1_CH16 Sample TIme_480Cycles (3*Channel_1)  
	ADC1->SQR3 |= 16 << (5*(3-1));	// ADC1_CH16 << (5 * (Rank - 1)),  Rank = 3 (3순위로 변환: 내부 온도센서(온도센서3))
        
//	 Enable DMA request after last transfer (Single-ADC mode) *
        ADC1->CR2 |= (1<<9); // DMA requests are issued	as long as data are converted and DMA=1	
				// for single ADC mode
        
//	 Enable ADC1 DMA *
	ADC1->CR2 |= (1<<8);	// DMA mode enabled  (DMA=1)
	ADC1->CR2 |= 0x00000001;	// Enable ADC1:  ADON=1
  
        NVIC->ISER[0] |= (1<<18);	// Enable ADC global Interrupt
        
	// Start ADC Software Conversion  
	ADC1->CR2 |= 0x40000000;   // SWSTART=1
}*/

/*
void TIMER1_OC_Init(void) //TIM1_CH3  주기= 400ms
{
	// PE11: TIM1_CH3   
	// PE11을 출력설정하고 Alternate function(TIM1_CH3)으로 사용 선언
	RCC->AHB1ENR   |= (1<<4);   // RCC_AHB1ENR GPIOE Enable
	GPIOE->MODER   |= (2<<2*11);   // GPIOE PIN11 Output Alternate function mode               
	GPIOE->OSPEEDR |= (3<<2*11);   // GPIOE PIN11 Output speed (100MHz High speed)
	GPIOE->OTYPER  = 0x00000000;   // GPIOE PIN11 Output type push-pull (reset state)
	GPIOE->PUPDR   |= (1<<2*11);   // GPIOE PIN11 Pull-up
	GPIOE->AFR[1]  |= (1<<12); // Connect TIM1 pins(PE11) to AF1(TIM1/2)

	
	// Timerbase Mode
	RCC->APB2ENR   |= 0x01;     // RCC_APB2ENR TIMER1 Enable

	TIM1->PSC = 8400-1;   // Prescaler 168,000,000Hz/8400= 20000Hz (0.05ms)

	
	TIM1->ARR = 8000-1;    // Auto reload  : 0.05ms * 8000 = 400ms(period) 
                                                                    
	TIM1->CR1 &= ~(1<<4);   // DIR: Countermode = Upcounter (reset state)
	TIM1->CR1 &= ~(3<<8);   // CKD: Clock division = 0 (reset state)
	TIM1->CR1 &= ~(3<<5);    // CMS(Center-aligned mode Sel): No(reset state)

	TIM1->EGR |= (1<<0);    // UG: Update generation 
    
	// Output/Compare Mode
	TIM1->CCER |= (1<<4);   // CC2E=1: CC2 channel Output Enable 
      
        TIM1->CCER &= ~(1<<5);  // CC2P=0: OCPolarity_Active High 

	TIM1->CCR2 = 100;   // TIM1_Pulse

	TIM1->BDTR |= (1<<15);  // main output enable  
   
	TIM1->CCMR1 &= ~(3<<8); // CC2S(CC1channel): Output 
	TIM1->CCMR1 &= ~(1<<11); // OC2PE: Output Compare 2 preload disable
	TIM1->CCMR1 |= (3<<12);   // OC2M: Output Compare 2 Mode : toggle

	TIM1->CR1 &= ~(1<<7);   // ARPE: Auto reload preload disable     

      
	TIM1->CR1 |= (1<<0);   // CEN: Enable the Tim1 Counter 
}
*/


void TIMER1_OC_Init(void) //TIM1_CH3  주기= 400ms
{
// PE13: TIM1_CH3
	// PE13을 출력설정하고 Alternate function(TIM1_CH3)으로 사용 선언
	RCC->AHB1ENR   |= (1<<4);   // RCC_AHB1ENR GPIOE Enable
	GPIOE->MODER   |= (2<<2*13);   // GPIOE PIN13 Output Alternate function mode               
	GPIOE->OSPEEDR |= (3<<2*13);   // GPIOE PIN13 Output speed (100MHz High speed)
	GPIOE->OTYPER  = 0x00000000;   // GPIOE PIN13 Output type push-pull (reset state)
	GPIOE->PUPDR   |= (1<<2*13);   // GPIOE PIN13 Pull-up
	GPIOE->AFR[1]  |= (1<<4*(13-8)); // Connect TIM1 pins(PE13) to AF1(TIM1/2)

	// Timerbase Mode
	RCC->APB2ENR   |= 0x01;// RCC_APB1ENR TIMER1 Enable

	TIM1->PSC = 8400-1;   // Prescaler 168,000,000Hz/8400= 20000Hz (0.05ms)

	
	TIM1->ARR = 8000-1;    // Auto reload  : 0.05ms * 8000 = 400ms(period) 
	
	TIM1->CR1 &= ~(1<<4);   // DIR: Countermode = Upcounter (reset state)
	TIM1->CR1 &= ~(3<<8);   // CKD: Clock division = 0 (reset state)
	TIM1->CR1 &= ~(3<<5);    // CMS(Center-aligned mode Sel): No(reset state)

