YUJJHH/Microcomputer_STM32F4IG_3.1-3.2/ADC3_채널테스트.c
	TIM1->EGR |= (1<<0);    // UG: Update generation 
    
	// Output/Compare Mode
	TIM1->CCER |= (1<<8);     // CC3E=1: CC3 channel Output Enable 
	                   
	TIM1->CCER &= ~(1<<(4*(3-1)+1));  // CC3P: OCPolarity_Active High

	TIM1->CCR3 = 100;   // TIM1_Pulse

	TIM1->BDTR |= (1<<15);  // main output enable  고급타이머
   
	TIM1->CCMR2 &= ~(3<<8*0); // CC3S(CC1channel): Output 
	TIM1->CCMR2 &= ~(1<<3); // OC3PE: Output Compare 3 preload disable
	TIM1->CCMR2 |= (3<<4);   // OC3M: Output Compare 3 Mode : toggle

	TIM1->CR1 &= ~(1<<7);   // ARPE: Auto reload preload disable      

        
	TIM1->DIER |= (1<<3);   // CC3IE: Enable the Tim1 CC3 interrupt
   
	NVIC->ISER[0] |= (1<<27); // TIM1_CC
	TIM1->CR1 |= (1<<0);   // CEN: Disable the Tim1 Counter 
}


void TIM1_CC_IRQHandler(void)	
{ 
            TIM1->SR &= ~(1<<3);	// CC Interrupt Claer


                     
              if(MOVE_FLAG==1)  //move 상태
              {
                      if(str1[0]==' ')   //거리센서1의 측정값의 십의자리가 공백이면 ( 일의자리만 있으면)
                      {
                        SerialSendChar(str1[1]);   //일의자리 PC로 송신
                        SerialSendChar('m');        // m  PC로 송신
                        SerialSendChar(' ');        //공백 PC로 송신
                      }
                      else           // 거리센서1의 측정값이 두 자리 수이면
                      {
                        SerialSendChar(str1[0]);     //십의자리  PC로 송신
                        SerialSendChar(str1[1]);    //  일의자리  PC로 송신
                          SerialSendChar('m');        // m  PC로 송신
                        SerialSendChar(' ');          //공백 PC로 송신
                      }
              }
              else  //stop 상태 
              {
              SerialSendChar('0');        // '0m '  PC로 송신
              SerialSendChar('m');        //
              SerialSendChar(' ');         
              }
              
}




void TIMER14_PWM_Init(void)  // 추종차 방향 제어, 주기 400us
{
//PF9/T14_CH1

// Clock Enable : GPIOF & TIMER14
	RCC->AHB1ENR	|= (1<<5);	// GPIOF Enable
	RCC->APB1ENR 	|= (1<<8);	// TIMER14 Enable 
    						
// PF9을 출력설정하고 Alternate function(TIM14_CH1)으로 사용 선언 : PWM 출력
	GPIOF->MODER 	|= (2<<18);	// PF9 Output Alternate function mode					
	GPIOF->OSPEEDR 	|= (3<<18);	// PF9 Output speed (100MHz High speed)
	GPIOF->OTYPER	&= ~(1<<9);	// PF9 Output type push-pull (reset state)
	GPIOF->AFR[1]	|= (9<<4); 	//  Connect TIM14 pins(PF9) to AF9(CAN1/CAN2, TIM12.. TIM14)
					// PF9==> TIM14_CH1
    

        
// TIM14 Channel 1 : PWM 1 mode
	// Assign 'PWM Pulse Period'
	TIM14->PSC	= 420-1;	// Prescaler 84,000,000Hz/420 = 200kHz(0.005ms)  (1~65536)
	TIM14->ARR	= 80-1;	// Auto reload  (0.005ms * 80 = 400us : PWM Period)
    
	// Define the corresponding pin by 'Output'  
	// CCER(Capture/Compare Enable Register) : Enable "Channel 1" 
	TIM14->CCER	|= (1<<0);	// CC1E=1: OC1(TIM14_CH1) Active(Capture/Compare 1 output enable)
					// 해당핀(27번)을 통해 신호출력
	TIM14->CCER	&= ~(1<<1);	// CC1P=0: CC1 output Polarity High (OC1으로 반전없이 출력)

	// Duty Ratio 
	TIM14->CCR1	= 80;		// CCR1 value   , 듀티비=100%

	// 'Mode' Selection : Output mode, PWM 1
	// CCMR1(Capture/Compare Mode Register 1) : Setting the MODE of Ch1
	TIM14->CCMR1 	&= ~(3<<0); 	// CC1S(CC1 channel)='0b00' : Output 
	TIM14->CCMR1 	|= (1<<3); 	// OC1PE=1: Output Compare 1 preload Enable

	TIM14->CCMR1	|= (6<<4);	// OC1M: Output compare 1 mode: PWM 1 mode
	TIM14->CCMR1	|= (1<<7);	// OC1CE: Output compare 1 Clear enable

	// CR1 : Up counting & Counter TIM14 enable
	TIM14->CR1 	&= ~(1<<4);	// DIR: Countermode = Upcounter (reset state)
	TIM14->CR1 	&= ~(3<<8);	// CKD: Clock division = 0 (reset state)
	TIM14->CR1 	&= ~(3<<5); 	// CMS(Center-aligned mode Sel): No(reset state)
	TIM14->CR1	&= ~(1<<7);	// ARPE: Auto-reload preload disable
	TIM14->CR1	|= (1<<0);	// CEN: Counter TIM14 enable
}



void TIMER4_PWM_Init(void)  // PWM 1 모드, 주기 5초,  추종차 속도 제어
{   
// TIM4_CH2 : PB7 (165번 핀)
// Clock Enable : GPIOB & TIMER4
	RCC->AHB1ENR	|= (1<<1);	// GPIOB CLOCK Enable
	RCC->APB1ENR 	|= (1<<2);	// TIMER4 CLOCK Enable 
    						
// PB7을 출력설정하고 Alternate function(TIM4_CH2)으로 사용 선언 : PWM 출력
	GPIOB->MODER 	|= (2<<14);	//  PB7 Output Alternate function mode					
	GPIOB->OSPEEDR 	|= (3<<14);	// PB7 Output speed (100MHz High speed)
	GPIOB->OTYPER	&= ~(1<<7);	// PB7 Output type push-pull (reset state)
	GPIOB->PUPDR	|= (1<<14);	//  PB7 Pull-up
 	GPIOB->AFR[0]	|= (2<<28);	// (AFR[0]): Connect TIM4 pins(PB7) to AF2(TIM3..5)
    
// TIM4 Channel 2 : PWM 1 mode
	// Assign 'PWM Pulse Period'
	TIM4->PSC	= 8400-1;	// Prescaler 84,000,000Hz/8400 = 10,000 Hz(0.1ms)  (1~65536)
	TIM4->ARR	= 50000-1;	// Auto reload  (0.1ms *50000  = 5s : PWM Period)

	// Setting CR1 : 0x0000 (Up counting)
	TIM4->CR1 &= ~(1<<4);	// DIR=0(Up counter)(reset state)
	TIM4->CR1 &= ~(1<<1);	// UDIS=0(Update event Enabled)
	TIM4->CR1 &= ~(1<<2);	// URS=0(Update event source Selection)g events
	TIM4->CR1 &= ~(1<<3);	// OPM=0(The counter is NOT stopped at update event) (reset state)
	TIM4->CR1 &= ~(1<<7);	// ARPE=0(ARR is buffered): ARR Preload Disable 
	TIM4->CR1 &= ~(3<<8); 	// CKD(Clock division)=00(reset state)
	TIM4->CR1 &= ~(3<<5); 	// CMS(Center-aligned mode Sel)=00 : Edge-aligned mode(reset state)          
        
 				
	// Define the corresponding pin by 'Output'  
	// CCER(Capture/Compare Enable Register) : Enable "Channel 2" 
	TIM4->CCER	|= (1<<4);	// CC2E=1: OC2(TIM4_CH2) Active(Capture/Compare 2 output enable)
					// 해당핀(165번)을 통해 신호출력
	
        TIM4->CCER	|= (1<<5);	// CC2P=1: CC2 Output Polarity (OCPolarity_LOW : 반전해서 출력)
      
	// Duty Ratio 
	TIM4->CCR2	= 5000;		// CCR2 value 듀티비=10%

	// 'Mode' Selection : Output mode, PWM 1
	// CCMR1(Capture/Compare Mode Register 1) : Setting the MODE of Ch1 or Ch2
	TIM4->CCMR1 &= ~(3<<8); // CC2S(CC2 channel)= '0b00' : Output 
	TIM4->CCMR1 &= ~(1<<11); 	// OC2PE=0: Output Compare 2 preload disable

