YUJJHH/Microcomputer_STM32F4IG_3.1-3.2/ADC3_채널테스트.c
	TIM4->CCMR1	|= (6<<12);	// OC2M=0b110: Output compare 2 mode: PWM 1 mode
     
	TIM4->CCMR1	|= (1<<15);	// OC2CE=1: Output compare 2 Clear enable
	
	//Counter TIM4 enable
	TIM4->CR1	|= (1<<0);	// CEN: Counter TIM4 enable
}

void DMAInit(void)  
{
 	// DMA2 Stream0 channel0 configuration *************************************
	RCC->AHB1ENR |= (1<<22);		//DMA2 clock enable
	DMA2_Stream0->CR |= (2<<25);	        //DMA2 Stream4 channel 1 selected

	// ADC1->DR(Peripheral) ==> ADC_vlaue(Memory)
	DMA2_Stream0->PAR |= (uint32_t)&ADC3->DR;	   //Peripheral address - ADC1->DR(Regular data) Address
	DMA2_Stream0->M0AR |= (uint32_t)&ADC_value;      //Memory address - ADC_Value address 
	DMA2_Stream0->CR &= ~(3<<6);		         //Data transfer direction : Peripheral-to-memory (P=>M)
	DMA2_Stream0->NDTR = 2;			         //DMA_BufferSize = 2 (ADC_Value[2])

	DMA2_Stream0->CR &= ~(1<<9); 	//Peripheral increment mode  - Peripheral address pointer is fixed
	DMA2_Stream0->CR |= (1<<10);	//Memory increment mode - Memory address pointer is incremented after each data transferd 
	DMA2_Stream0->CR |= (1<<11);	//Peripheral data size - halfword(16bit)
	DMA2_Stream0->CR |= (1<<13);	//Memory data size - halfword(16bit)   
	DMA2_Stream0->CR |= (1<<8);	//Circular mode enabled   
	DMA2_Stream0->CR |= (2<<16);	//Priority level - High
        
        DMA2_Stream0->FCR &= ~(1<<2);	//DMA_FIFO_direct mode enabled
	DMA2_Stream0->FCR |= (1<<0);	//DMA_FIFO Threshold_HalfFull , Not used in direct mode

	DMA2_Stream0->CR &= ~(3<<23);	//Memory burst transfer configuration - single transfer
	DMA2_Stream0->CR &= ~(3<<21);	//Peripheral burst transfer configuration - single transfer  
	DMA2_Stream0->CR |= (1<<0);	//DMA2_Stream0 enabled
}

void USART1_Init(void)
{
	// USART1 : TX(PA9)
	RCC->AHB1ENR	|= (1<<0);	// RCC_AHB1ENR GPIOA Enable
	GPIOA->MODER	|= (2<<2*9);	// GPIOA PIN9 Output Alternate function mode					
	GPIOA->OSPEEDR	|= (3<<2*9);	// GPIOA PIN9 Output speed (100MHz Very High speed)
	GPIOA->AFR[1]	|= (7<<4);	// Connect GPIOA pin9 to AF7(USART1)
    
	// USART1 : RX(PA10)
	GPIOA->MODER 	|= (2<<2*10);	// GPIOA PIN10 Output Alternate function mode
	GPIOA->OSPEEDR	|= (3<<2*10);	// GPIOA PIN10 Output speed (100MHz Very High speed
	GPIOA->AFR[1]	|= (7<<8);	// Connect GPIOA pin10 to AF7(USART1)

	RCC->APB2ENR	|= (1<<4);	// RCC_APB2ENR USART1 Enable
    
	USART_BRR_Configuration(9600); // USART Baud rate Configuration
    
	USART1->CR1	|= (1<<12);	// USART_WordLength 9 Data bit
	USART1->CR1	|= (1<<10);	// YES USART_Parity
        USART1->CR1	|= (1<<9);	// USART_Parity Odd

	USART1->CR1	|= (1<<2);	// 0x0004, USART_Mode_RX Enable
	USART1->CR1	|= (1<<3);	// 0x0008, USART_Mode_Tx Enable

	USART1->CR2	&= ~(3<<12);	// 0b00, USART_StopBits_1
	USART1->CR3	= 0x0000;	// No HardwareFlowControl, No DMA
    
	USART1->CR1 	|= (1<<5);	// 0x0020, RXNE interrupt Enable
	NVIC->ISER[1]	|= (1<<(37-32));// Enable Interrupt USART1 (NVIC 37번)

	USART1->CR1 	|= (1<<13);	//  0x2000, USART1 Enable
}

void USART1_IRQHandler(void)	
{       
	if ( (USART1->SR & USART_SR_RXNE) ) // USART_SR_RXNE= 1? RX Buffer Full?
	// #define  USART_SR_RXNE ((uint16_t)0x0020)    //  Read Data Register Not Empty     
	{
		char ch;
            
		
                ch = (uint16_t)(USART1->DR & (uint16_t)0x01FF);	// 수신된 문자 저장
                //SerialSendChar(ch); 		// PC에 수신된 문자를 Echo
       
                LCD_SetFont(&Gulim7);
                LCD_SetBackColor(RGB_WHITE);	//글자배경색      
                LCD_SetTextColor(RGB_BLACK);     //글자색 
                LCD_DisplayText(4,0,"SP(DR):");
                LCD_DisplayText(4,9,"%   DIR(DR):");
                LCD_SetTextColor(RGB_BLUE);     //글자색 
                
                if(ch=='M')  //M을 수신 받으면
                {   
                      
                    MOVE_FLAG=1;   //MOVE 동작
                    LCD_DisplayText(1,24," M");  //MOVE 표시
                     
                    Fram_Write(1201,MOVE_FLAG);         //MOVE 상태 저장
                    
                }
                if(ch=='S')  //S를 수신 받으면
                {
                    MOVE_FLAG=0;        //MOVE 동작 x      
                        
                    LCD_DisplayText(1,24," S");  //STOP 표시
                    LCD_DisplayText(2,24," 0"); //D1 거리 0
                    LCD_DisplayText(3,24," 1"); // D2 거리 1
                               
                              
                    TIM4->CCR2=0;  //엔진 PWM  DR=0%
                    TIM14->CCR1=0;  //핸들 PWM  DR=0%
                              
                    //D1 막대 지움
                    LCD_SetBrushColor(RGB_WHITE);     //브러시색 흰색
                    LCD_DrawFillRect(21,23,6*(19),9);    
                    
                    y=1;  // D2막대 1 표시
                    LCD_SetBrushColor(RGB_WHITE);     //막대 지우고 생성
                    LCD_DrawFillRect(21+38*y,34,38*(3-y),9);    
                     
                    LCD_SetBrushColor(RGB_GREEN);           
                    LCD_DrawFillRect(21,34,38*y,9);   
                     
                    LCD_DisplayText(4,7,"00");  //엔진 PWM DR=0%
                    LCD_DisplayText(4,21,"F");  // 핸들 직진, F
                           
                    Fram_Write(1201,MOVE_FLAG);         //STOP 상태 저장 
                }    
                 
	} 
	// DR 을 읽으면 SR.RXNE bit(flag bit)는 clear 된다. 즉 clear 할 필요없음 
}


void EXTI15_10_IRQHandler(void)		
{
	LCD_SetFont(&Gulim7);
        LCD_SetBackColor(RGB_WHITE);	//글자배경색      
        LCD_SetTextColor(RGB_BLACK);     //글자색 
        LCD_DisplayText(4,0,"SP(DR):");
        LCD_DisplayText(4,9,"%   DIR(DR):");
       
                     
        if(EXTI->PR & (1<<12))                   // EXTI12 Interrupt Pending(발생) 여부?  
	{
                  EXTI->PR |= (1<<12);       // Pending bit Clear      
                  MOVE_FLAG=1;   //MOVE 동작
                  
                  LCD_SetTextColor(RGB_BLUE);     //글자색 
                  LCD_DisplayText(1,24," M");  //MOVE 표시
                   
                 Fram_Write(1201,MOVE_FLAG);         //MOVE 상태 저장
                 
             
