YUJJHH/Microcomputer_STM32F4IG_3.1-3.2/ADC3_채널테스트.c
	}
       
        if(EXTI->PR & (1<<14))                   // EXTI14 Interrupt Pending(발생) 여부?  
	{
                EXTI->PR |= (1<<14);       // Pending bit Clear    	
                MOVE_FLAG=0;        //MOVE 동작 x      
                
                 LCD_SetTextColor(RGB_BLUE);     //글자색         
                 LCD_DisplayText(1,24," S");  //STOP 표시
                 LCD_DisplayText(2,24," 0"); //D1 거리 0
                 LCD_DisplayText(3,24," 1"); // D2 거리 1
                               
                              
                 TIM4->CCR2=0;  //엔진 PWM  DR=0%
                 TIM14->CCR1=0;  //핸들 PWM  DR=0%
                              
                 //D1 막대 지움
                 LCD_SetBrushColor(RGB_WHITE);     //브러시색 흰색
                 LCD_DrawFillRect(21,23,6*(19),9);    
                    
                 y=1;  // D2막대 1 표시
                 LCD_SetBrushColor(RGB_WHITE);     //막대 지우고 생성
                 LCD_DrawFillRect(21+38*y,34,38*(3-y),9);    
                     
                 LCD_SetBrushColor(RGB_GREEN);           
                 LCD_DrawFillRect(21,34,38*y,9);   
                     
                 LCD_DisplayText(4,7,"00");  //엔진 PWM DR=0%
                 LCD_DisplayText(4,21,"F");  // 핸들 직진, F
                           
                 Fram_Write(1201,MOVE_FLAG);         //STOP 상태 저장 
        
           
	}
}
   


void _EXTI_Init(void)  
{
	RCC->AHB1ENR 	|= 0x00000080;	// RCC_AHB1ENR GPIOH Enable
	RCC->APB2ENR 	|= 0x00004000;	// Enable System Configuration Controller Clock
			// 0b 0000 0000 0000 0000 0100 0000 0000 0000
	GPIOH->MODER 	&= ~0xFFFF0000;	// GPIOH PIN8~PIN15 Input mode (reset state)				 
	
	SYSCFG->EXTICR[3] |= 0x0007;	// EXTI12에 대한 소스 입력은 GPIOH로 설정
        SYSCFG->EXTICR[3] |= 0x0700; 	// EXTI14에 대한 소스 입력은 GPIOH로 설정

	EXTI->FTSR |= (1<<12);	// EXTI12: Falling Trigger Enable 
	EXTI->IMR   |=  (1<<12);	// EXTI12 인터럽트 mask (Interrupt Enable) 설정

        EXTI->FTSR |= (1<<14);	// EXTI14: Falling Trigger Enable 
	EXTI->IMR   |=  (1<<14);	// EXTI14 인터럽트 mask (Interrupt Enable) 설정

	NVIC->ISER[1] |= (1<< (40-32));	// Enable 'Global Interrupt EXTI12,14'
}

void SerialSendChar(uint8_t Ch) // 1문자 보내기 함수
{
	// USART_SR_TXE(1<<7)=0?, TX Buffer NOT Empty? 
	// TX buffer Empty되지 않으면 계속 대기(송신 가능한 상태까지 대기)
        while((USART1->SR & USART_SR_TXE) == RESET); 
	USART1->DR = (Ch & 0x01FF);	// 전송 (최대 9bit 이므로 0x01FF과 masking)
}

void SerialSendString(char *str) // 여러문자 보내기 함수
{
	while (*str != '\0') // 종결문자가 나오기 전까지 구동, 종결문자가 나온후에도 구동시 메모리 오류 발생가능성 있음.
	{
		SerialSendChar(*str);	// 포인터가 가르키는 곳의 데이터를 송신
		str++; 			// 포인터 수치 증가
	}
}

// Baud rate 설정
void USART_BRR_Configuration(uint32_t USART_BaudRate)
{ 
	uint32_t tmpreg = 0x00;
	uint32_t APB2clock = 84000000;	//PCLK2_Frequency
	uint32_t integerdivider = 0x00;
	uint32_t fractionaldivider = 0x00;

	// Find the integer part 
	if ((USART1->CR1 & USART_CR1_OVER8) != 0) // USART_CR1_OVER8=(1<<15)
	//  #define  USART_CR1_OVER8 ((uint16_t)0x8000) // USART Oversampling by 8 enable   
	{       // USART1->CR1.OVER8 = 1 (8 oversampling)
		// Computing 'Integer part' when the oversampling mode is 8 Samples 
		integerdivider = ((25 * APB2clock) / (2 * USART_BaudRate));  // 공식에 100을 곱한 곳임(소수점 두번째자리까지 유지하기 위함)  
	}
	else  // USART1->CR1.OVER8 = 0 (16 oversampling)
	{	// Computing 'Integer part' when the oversampling mode is 16 Samples 
		integerdivider = ((25 * APB2clock) / (4 * USART_BaudRate));  // 공식에 100을 곱한 곳임(소수점 두번째자리까지 유지하기 위함)    
	}								     // 100*(f_CK) / (8*2*Buadrate) = (25*f_CK)/(4*Buadrate)	
	tmpreg = (integerdivider / 100) << 4;
  
	// Find the fractional part 
	fractionaldivider = integerdivider - (100 * (tmpreg >> 4));

	// Implement the fractional part in the register 
	if ((USART1->CR1 & USART_CR1_OVER8) != 0)	
	{	// 8 oversampling
		tmpreg |= (((fractionaldivider * 8) + 50) / 100) & (0x07);
	}
	else	// 16 oversampling
	{
		tmpreg |= (((fractionaldivider * 16) + 50) / 100) & (0x0F);
	}

	// Write to USART BRR register
	USART1->BRR = (uint16_t)tmpreg;
}

void _GPIO_Init(void)
{
	// LED (GPIO G) 설정
	RCC->AHB1ENR	|=  0x00000040;	// RCC_AHB1ENR : GPIOG(bit#6) Enable							
	GPIOG->MODER 	|=  0x00005555;	// GPIOG 0~7 : Output mode (0b01)						
	GPIOG->OTYPER	&= ~0x00FF;	// GPIOG 0~7 : Push-pull  (GP8~15:reset state)	
	GPIOG->OSPEEDR 	|=  0x00005555;	// GPIOG 0~7 : Output speed 25MHZ Medium speed 
    
	// SW (GPIO H) 설정 
	RCC->AHB1ENR    |=  0x00000080;	// RCC_AHB1ENR : GPIOH(bit#7) Enable							
	GPIOH->MODER 	&= ~0xFFFF0000;	// GPIOH 8~15 : Input mode (reset state)				
	GPIOH->PUPDR 	&= ~0xFFFF0000;	// GPIOH 8~15 : Floating input (No Pull-up, pull-down) :reset state

	// Buzzer (GPIO F) 설정 
	RCC->AHB1ENR	|=  0x00000020; // RCC_AHB1ENR : GPIOF(bit#5) Enable							
	GPIOF->MODER 	|=  0x00040000;	// GPIOF 9 : Output mode (0b01)						
	GPIOF->OTYPER 	&= ~0x0200;	// GPIOF 9 : Push-pull  	
	GPIOF->OSPEEDR 	|=  0x00040000;	// GPIOF 9 : Output speed 25MHZ Medium speed 
}

void RunMenu(void)         
{
	LCD_Clear(RGB_WHITE);
	LCD_SetFont(&Gulim7);
	LCD_SetBackColor(RGB_WHITE);	//글자배경색
	LCD_SetTextColor(RGB_BLACK);     //글자색 검정
 	LCD_DisplayText(0,0,"YJH 2019130027");
     
        LCD_DisplayText(1,0,"Tracking Car");
        LCD_DisplayText(2,0,"D1:");
         LCD_DisplayText(3,0,"D2:");
         LCD_DisplayText(4,0,"SP(DR):");
         LCD_DisplayText(4,9,"%   DIR(DR):");
         
       
         
       /*              나중에 지울것
         //시스템 초기상태
         LCD_SetTextColor(RGB_BLUE);     //글자색 블루
         
          LCD_DisplayText(1,24,"S");
          LCD_DisplayText(2,24,"0");
          LCD_DisplayText(3,24,"1");
            
         
             y=1;    //D2 거리 1
        
             if(y>=0 && y<=3)      
             {
                 LCD_SetBrushColor(RGB_WHITE);     //브러시색 흰색
                 LCD_DrawFillRect(22+38*y,34,38*(3-y),8);    
             
                 LCD_SetBrushColor(RGB_GREEN);        //브러시색  초록   
                 LCD_DrawFillRect(22,34,38*y,8);   
             }
         
         
          LCD_DisplayText(4,21,"F");  // 핸들 직진 F
                    LCD_DisplayText(4,7,"00");  //엔진 PWM DR=0%
         
         */
  	
}
uint8_t key_flag = 0;
uint16_t KEY_Scan(void)	// input key SW0 - SW7 
{ 
	uint16_t key;
	key = GPIOH->IDR & 0xFF00;	// any key pressed ?
	if(key == 0xFF00)		// if no key, check key off
	{  	if(key_flag == 0)
			return key;
		else
		{	DelayMS(10);
			key_flag = 0;
			return key;
		}
	}
	else				// if key input, check continuous key
	{	if(key_flag != 0)	// if continuous key, treat as no key input
			return 0xFF00;
		else			// if new key,delay for debounce
		{	key_flag = 1;
			DelayMS(10);
			return key;
		}
	}
}
void DelayMS(unsigned short wMS)
{
	register unsigned short i;
	for (i=0; i<wMS; i++)
		DelayUS(1000);         	// 1000us => 1ms
}

void DelayUS(unsigned short wUS)
{
	volatile int Dly = (int)wUS*17;
	for(; Dly; Dly--);
}


